InformationRegisters/УДАЛИТЬ_НастройкиДифференцированнойСтоимостиУглов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>УДАЛИТЬ_НастройкиДифференцированнойСтоимостиУглов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КоличествоОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УДАЛИТЬ_НастройкиДифференцированнойСтоимостиУглов/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаписатьНаСервере()
	Записи = РегистрыСведений.УДАЛИТЬ_НастройкиДифференцированнойСтоимостиУглов.СоздатьНаборЗаписей();
	Для каждого Стр из СписокНастроек Цикл
		Запись = Записи.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Стр);
	КонецЦикла;
	Записи.Записать(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройки(Команда)
	ЗаписатьНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиДифференцированнойСтоимостиУглов.КоличествоОт,
	|	НастройкиДифференцированнойСтоимостиУглов.Цена
	|ИЗ
	|	РегистрСведений.НастройкиДифференцированнойСтоимостиУглов КАК НастройкиДифференцированнойСтоимостиУглов";
	СписокНастроек.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура СписокНастроекКоличествоОтПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокНастроекПередНачаломИзменения(Элемент, Отказ)
	ПредКолво = Элемент.ТекущиеДанные.КоличествоОт;
	ПредЦена = Элемент.ТекущиеДанные.Цена;
КонецПроцедуры

&НаСервере
Функция Минимум()
	Возврат Константы.УДАЛИТЬ_КоличествоУгловПриБесплатномРаскрое.Получить(); //!!!
КонецФункции

&НаКлиенте
Процедура СписокНастроекПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если ОтменаРедактирования Тогда
		Элемент.ТекущиеДанные.КоличествоОт = ПредКолво;
		Элемент.ТекущиеДанные.Цена = ПредЦена;
	Иначе
		Для Каждого Стр из СписокНастроек Цикл
			Если Элемент.ТекущиеДанные.КоличествоОт <= Минимум() Тогда
				ПоказатьПредупреждение(, "Количество должно быть больше количества углов при бесплатном раскрое!");
				Отказ = Истина;
				Прервать;
			КонецЕсли;
			
			Если Не СписокНастроек.Индекс(Стр) = Элемент.ТекущаяСтрока Тогда
				Если Элемент.ТекущиеДанные.КоличествоОт = Стр.КоличествоОт Тогда
					ПоказатьПредупреждение(, "Количество уже есть в настройках!");
					Отказ = Истина;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
